{"keras_version": "2.2.4", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 128, 128, 3], "sparse": false}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "trainable": true, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "padding": "same", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "trainable": true, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "padding": "same", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "trainable": true, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "padding": "same", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "trainable": true, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "padding": "same", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "trainable": true, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "padding": "same", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "trainable": true, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 1], "sparse": false}, "inbound_nodes": []}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_1", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "units": 1, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "backend": "tensorflow"}