{"class_name": "Model", "keras_version": "2.2.4", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 128, 128, 4]}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "filters": 32, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "filters": 32, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "filters": 32, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "filters": 32, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "max_pooling2d_4"}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "filters": 32, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_5", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "max_pooling2d_5"}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "filters": 32, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}], "output_layers": [["dense_1", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}