{"keras_version": "2.2.4", "config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 4], "sparse": false, "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "activation": "relu", "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32}, "class_name": "Conv2D", "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "activation": "relu", "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32}, "class_name": "Conv2D", "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "activation": "relu", "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32}, "class_name": "Conv2D", "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_4", "activation": "relu", "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32}, "class_name": "Conv2D", "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_4", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_4"}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_5", "activation": "relu", "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32}, "class_name": "Conv2D", "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_5", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_5"}, {"inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_6", "activation": "relu", "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32}, "class_name": "Conv2D", "name": "conv2d_6"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"units": 1, "bias_constraint": null, "trainable": true, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_1"}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}