{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 4], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "filters": 32, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"config": {"use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "filters": 32, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"config": {"use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "filters": 32, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3"}, {"config": {"use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "filters": 32, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_4", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_4"}, {"config": {"use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "filters": 32, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_5", "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_5"}, {"config": {"use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "filters": 32, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1"}, {"config": {"use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "units": 1, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1"}], "name": "model_1"}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}