{"config": {"name": "model_1", "output_layers": [["dense_1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 128, 128, 4], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "name": "conv2d_1", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2"}, {"config": {"trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "name": "conv2d_3", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3"}, {"config": {"trainable": true, "name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "name": "conv2d_4", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4"}, {"config": {"trainable": true, "name": "max_pooling2d_4", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_4"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "name": "conv2d_5", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5"}, {"config": {"trainable": true, "name": "max_pooling2d_5", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_5"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "name": "conv2d_6", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "units": 1}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1"}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow"}