{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": true}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": true}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": true}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": true}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "max_pooling2d_5", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": true}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "units": 1, "bias_constraint": null, "trainable": true}}]}}